ИС_СПОРТ_2022/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </resources>
  <resources>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/ДокументыФизическихЛиц/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФизическоеЛицо") Тогда
		Запись.ФизическоеЛицо = Параметры.ФизическоеЛицо;
	КонецЕсли;	
	
КонецПроцедуры

// {Рарус adilas #9846 -Автоматическое заполнение Срока действия документов 2020.10.01
//
&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Запись.СрокДействия = СрокДействияДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Запись.СрокДействия = СрокДействияДокумента();
КонецПроцедуры

&НаСервере
Функция СрокДействияДокумента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		|	&ВидДокумента КАК ВидДокумента
		|ПОМЕСТИТЬ ВТ_ФизическоеЛицо
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ТекущаяДата КАК ТекущаяДата,
		|	ВТ_ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
		|	РАЗНОСТЬДАТ(ВТ_ФизическоеЛицо.ДатаРождения, &ТекущаяДата, ДЕНЬ) КАК ВозрастВДнях,
		|	ВЫБОР
		|		КОГДА ВТ_ФизическоеЛицо.ВидДокумента = ""Свидетельство о рождении""
		|			ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ФизическоеЛицо.ДатаРождения, ДЕНЬ, 5113)
		|		КОГДА ВТ_ФизическоеЛицо.ВидДокумента = ""Паспорт гражданина РФ""
		|			ТОГДА ВЫБОР
		|					КОГДА РАЗНОСТЬДАТ(ВТ_ФизическоеЛицо.ДатаРождения, &ТекущаяДата, ГОД) >= 20
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ФизическоеЛицо.ДатаРождения, ДЕНЬ, 16435)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ФизическоеЛицо.ДатаРождения, ДЕНЬ, 7304)
		|				КОНЕЦ
		|		КОГДА ВТ_ФизическоеЛицо.ВидДокумента = ""Загранпаспорт гражданина РФ""
		|			ТОГДА ВЫБОР
		|					КОГДА РАЗНОСТЬДАТ(ВТ_ФизическоеЛицо.ДатаРождения, &ТекущаяДата, ГОД) >= 20
		|						ТОГДА ДОБАВИТЬКДАТЕ(ВТ_ФизическоеЛицо.ДатаРождения, ДЕНЬ, 16435)
		|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ФизическоеЛицо.ДатаРождения, ДЕНЬ, 7304)
		|				КОНЕЦ
		|	КОНЕЦ КАК СрокДействия
		|ИЗ
		|	ВТ_ФизическоеЛицо КАК ВТ_ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", Запись.ФизическоеЛицо);
	Запрос.УстановитьПараметр("ВидДокумента", Запись.ВидДокумента.Наименование);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
			СрокДействия = ВыборкаДетальныеЗаписи.СрокДействия;
			Возврат СрокДействия; 
		КонецЦикла;		
	КонецЕсли;
КонецФункции

// }Рарус adilas #9846 -Автоматическое заполнение Срока действия документов 2020.10.01

#КонецОбласти
